In [9]:
#pandas3-4

import pandas as pd
import numpy as np

print(pd.__version__)
print(np.__version__)

data = {'coll': ['1', '2', '3', 'teks'], 
        'col2': ['1', '2', '3', '4']}

df= pd.DataFrame(data)

df

2.0.3
1.24.3

   coll col2
0     1    1
1     2    2
2     3    3
3  teks    4

In [10]:
df_x= df.astype({'col2': 'float'}) 
df_x
#fungsi astype()

   coll  col2
0     1   1.0
1     2   2.0
2     3   3.0
3  teks   4.0

In [11]:
df_x.dtypes

coll     object
col2    float64
dtype: object

In [12]:
df.apply(pd.to_numeric, errors='coerce')
#numeric()

   coll  col2
0   1.0     1
1   2.0     2
2   3.0     3
3   NaN     4

In [13]:
n_rows = 5
n_cols = 2 
cols = ['bil_pecahan', 'bil_bulat']

df = pd.DataFrame(np.random.randint(1, 20, size=(n_rows, n_cols)), columns=cols)

# Mengonversi kolom 'bil_pecahan' ke tipe float
df['bil_pecahan'] = df['bil_pecahan'].astype('float')

df.index = pd.date_range(start='2023-01-01', periods=n_rows, freq='H')

# Reset index agar 'date' menjadi kolom
df = df.reset_index()

# Menambahkan kolom teks
df['teks'] = list('ABCDE')

df

                index  bil_pecahan  bil_bulat teks
0 2023-01-01 00:00:00          8.0         10    A
1 2023-01-01 01:00:00          3.0         10    B
2 2023-01-01 02:00:00         18.0         17    C
3 2023-01-01 03:00:00          1.0          7    D
4 2023-01-01 04:00:00         14.0         19    E

In [14]:
df.dtypes

index          datetime64[ns]
bil_pecahan           float64
bil_bulat               int32
teks                   object
dtype: object

In [15]:
df.select_dtypes(include='number')

   bil_pecahan  bil_bulat
0          8.0         10
1          3.0         10
2         18.0         17
3          1.0          7
4         14.0         19

In [16]:
df.select_dtypes(include='float')

   bil_pecahan
0          8.0
1          3.0
2         18.0
3          1.0
4         14.0

In [17]:
df.select_dtypes(include='int')

   bil_bulat
0         10
1         10
2         17
3          7
4         19

In [18]:
df.select_dtypes(include='object')

  teks
0    A
1    B
2    C
3    D
4    E

In [19]:
df.select_dtypes(include='datetime')

                index
0 2023-01-01 00:00:00
1 2023-01-01 01:00:00
2 2023-01-01 02:00:00
3 2023-01-01 03:00:00
4 2023-01-01 04:00:00

In [20]:
df.select_dtypes(include=['number', 'object'])

   bil_pecahan  bil_bulat teks
0          8.0         10    A
1          3.0         10    B
2         18.0         17    C
3          1.0          7    D
4         14.0         19    E